*David Schlangen, 2019-03-20*

# All Preprocessed Data Frames

Showcases the results of the preprocessing.

In [1]:
from __future__ import division
import codecs
import json
import ConfigParser
import sys
import os
from glob import glob

import pandas as pd
from IPython.display import display

In [2]:
# load config file, set up paths, make project-specific imports
config_path = os.environ.get('VISCONF')
if not config_path:
    # try default location, if not in environment
    default_path_to_config = '../Config/default.cfg'
    if os.path.isfile(default_path_to_config):
        config_path = default_path_to_config

assert config_path is not None, 'You need to specify the path to the config file via environment variable VISCONF.'        

config = ConfigParser.SafeConfigParser()
with codecs.open(config_path, 'r', encoding='utf-8') as f:
    config.readfp(f)

corpora_base = config.get('DEFAULT', 'corpora_base')
preproc_path = config.get('DSGV-PATHS', 'preproc_path')

dsgv_home = config.get('DSGV-PATHS', 'dsgv_home')
sys.path.append(dsgv_home + '/Utils')
from utils import icorpus_code, plot_labelled_bb, get_image_filename

In [3]:
# display some lines from each DataFrame found in the preprocessing directory

overview_df = []

for this_df_path in glob(os.path.join(preproc_path, '*.json.gz')):
    this_df = os.path.basename(this_df_path).split('.')[0]
    
    df_loaded = pd.read_json(this_df_path, typ='frame', orient='split', compression='gzip')
    
    print '-' * 20, this_df, '-' * 20
    print ''
    print 'n rows: {:,}'.format(len(df_loaded))
    overview_df.append((this_df, len(df_loaded)))
    display(df_loaded.head(5))
    print ''

print '=' * 20, 'Summary', '=' * 20
display(pd.DataFrame(overview_df, columns='name rows'.split()))

-------------------- ade_imgdf --------------------

n rows: 19,733

   i_corpus  image_id           image_cat     split                filename
0         6         1  a/airport_terminal  training  ADE_train_00000001.jpg
1         6         2  a/airport_terminal  training  ADE_train_00000002.jpg
2         6         3       a/art_gallery  training  ADE_train_00000003.jpg
3         6         4          b/badlands  training  ADE_train_00000004.jpg
4         6         5          b/ball_pit  training  ADE_train_00000005.jpg

-------------------- ade_objdf --------------------

n rows: 550,545

,attr,bb,i_corpus,image_id,label,level,occl,region_id,synset
0,glass,"[762, 810, 629, 127]",6,1,wall,0,False,1,wall
1,glass,"[13, 580, 729, 301]",6,1,wall,0,False,2,wall
2,glass,"[1415, 622, 631, 258]",6,1,wall,0,False,3,wall
3,,"[2, 1012, 607, 457]",6,1,wall,0,False,4,wall
4,,"[536, 1020, 517, 92]",6,1,wall,0,False,5,wall

-------------------- ade_reldf --------------------

n rows: 146,392

   i_corpus  image_id  part_id  part_level  region_id  region_level
0         6         2        3           1         47             0
1         6         2        5           1         47             0
2         6         2        6           1         47             0
3         6         2        7           1         51             0
4         6         2        8           1         51             0

-------------------- cococapdf --------------------

n rows: 414,113

                                             caption   id  image_id  i_corpus
0     A very clean and well decorated empty bathroom   48    318556         1
1  A panoramic view of a kitchen and all of its a...   67    116100         1
2  A blue and white bathroom with butterfly theme...  126    318556         1
3     A panoramic photo of a kitchen and dining room  148    116100         1
4  A graffiti-ed stop sign across the street from...  173    379340         1

-------------------- cocoent_capdf --------------------

n rows: 592,881

,i_corpus,image_id,split,cap,cap_ent
0,1,378466,train,a man laying in bed next to his dog,[a man]#_#_ laying in [bed]#bed#1 next to [his...
1,1,378466,train,a shirtless man poses next to his dog,[a shirtless man]#_#_ poses next to [his dog]#...
2,1,378466,train,a person that is laying next to a dog,[a person]#_#_ that is laying next to [a dog]#...
3,1,378466,train,a man is lying down on the bed looking,[a man]#_#_ is lying down on [the bed]#bed#1
4,1,378466,train,a man with a beard without a shirt and a sleep...,[a man]#_#_ with [a beard]#_#_ without [a shir...

-------------------- cocoent_objdf --------------------

n rows: 1,182,608

,i_corpus,image_id,region_id,split,bb,type
0,1,378466,0,train,"[199.980941772, 3.4313561916, 410.999038696, 5...",dog
1,1,378466,2,train,"[0.0, 206.988494873, 431.71282959, 403.991485596]",dog
2,1,378466,4,train,"[0.0, 0.0, 497.864685059, 298.009155273]",dog
3,1,378466,18,train,"[349.758270264, 200.922744751, 192.163421631, ...",dog
4,1,378466,1,train,"[0.0, 384.108123779, 610.979980469, 226.871856...",bed

-------------------- cocogrprops_bbdf --------------------

n rows: 17,184

   i_corpus  image_id  region_id                    bb            cat
0         3    100034          0  [379, 120, 250, 417]         person
1         3    100034          1  [242, 168, 237, 462]         person
2         3    100034          2   [328, 169, 111, 87]  tennis racket
3         3    100034          3    [425, 133, 88, 99]  tennis racket
4         3    100034          4   [189, 82, 195, 175]         person

-------------------- cub_attrdf --------------------

n rows: 371,011

   i_corpus  image_id               att               val
0         9         1    has_bill_shape    hooked_seabird
1         9         1  has_head_pattern            masked
2         9         1  has_throat_color              buff
3         9         1     has_eye_color             brown
4         9         1   has_bill_length  longer_than_head

-------------------- cub_bbdf --------------------

n rows: 11,787

,i_corpus,image_id,image_path,category,bb,is_train
0,9,1,001.Black_footed_Albatross/Black_Footed_Albatr...,Black_footed_Albatross,"[60, 27, 325, 304]",0
1,9,2,001.Black_footed_Albatross/Black_Footed_Albatr...,Black_footed_Albatross,"[139, 30, 153, 264]",1
2,9,3,001.Black_footed_Albatross/Black_Footed_Albatr...,Black_footed_Albatross,"[14, 112, 388, 186]",0
3,9,4,001.Black_footed_Albatross/Black_Footed_Albatr...,Black_footed_Albatross,"[112, 90, 255, 242]",1
4,9,5,001.Black_footed_Albatross/Black_Footed_Albatr...,Black_footed_Albatross,"[70, 50, 134, 303]",1

-------------------- cub_capdf --------------------

n rows: 117,870

,i_corpus,image_id,caption,cat
0,9,39,"the medium sized bird has a dark grey color, a...",001.Black_footed_Albatross
1,9,39,the bird is dark grey brown with a thick curve...,001.Black_footed_Albatross
2,9,39,"bird has brown body feathers, white breast fea...",001.Black_footed_Albatross
3,9,39,"this bird has a dark brown overall body color,...",001.Black_footed_Albatross
4,9,39,"the bird has very long and large brown wings, ...",001.Black_footed_Albatross

-------------------- cub_partdf --------------------

n rows: 141,395

   i_corpus  image_id  part_name    x    y
0         9         1       beak  312  182
1         9         1      crown  186   45
2         9         1   forehead  247   79
3         9         1       nape  100  221
4         9         1  right eye  183  101

-------------------- flickr_bbdf --------------------

n rows: 275,775

   i_corpus    image_id  region_id  subregion_id                   bb
0         8  1000092795          1             1  [159, 125, 60, 210]
1         8  1000092795          4             1   [1, 220, 210, 253]
2         8  1000092795          4             2  [276, 215, 56, 122]
3         8  1000092795          1             2  [197, 110, 64, 263]
4         8  1000092795          5             1  [207, 144, 50, 100]

-------------------- flickr_capdf --------------------

n rows: 158,915

,i_corpus,image_id,caption_annotated,caption_raw,entities
0,8,1000092795,[/EN#1/people Two young guys] with [/EN#2/body...,two young guys with shaggy hair look at their ...,"[1, 2, 3, 8]"
1,8,1000092795,"[/EN#1/people Two young , White males] are out...","two young , white males are outside near many ...","[1, 4]"
2,8,1000092795,[/EN#1/people Two men] in [/EN#5/clothing gree...,two men in green shirts are standing in a yard .,"[1, 5, 9]"
3,8,1000092795,[/EN#6/people A man] in [/EN#7/clothing a blue...,a man in a blue shirt standing in a garden .,"[6, 7, 9]"
4,8,1000092795,[/EN#1/people Two friends] enjoy [/EN#10/other...,two friends enjoy time spent together .,"[1, 10]"

-------------------- flickr_objdf --------------------

n rows: 559,767

   i_corpus    image_id  region_id                   phrase        cat
0         8  1000092795          1           Two young guys     people
1         8  1000092795          2              shaggy hair  bodyparts
2         8  1000092795          3              their hands  bodyparts
3         8  1000092795          8                 the yard      scene
4         8  1000092795          1  Two young , White males     people

-------------------- grex_refdf --------------------

n rows: 95,010

,i_corpus,image_id,region_id,r_corpus,rex_id,refexp,tagged
0,1,465670,100000,grex,87967,a brown colored couch with a man laying on it,"[[a, DT], [brown, NN], [colored, VBD], [couch,..."
1,1,470174,100002,grex,40654,a long three cushioned leather couch up agains...,"[[a, DT], [long, JJ], [three, CD], [cushioned,..."
2,1,470174,100002,grex,40655,brown leather looking couch on right side agai...,"[[brown, IN], [leather, RB], [looking, VBG], [..."
3,1,92439,100013,grex,80865,a black leather couch,"[[a, DT], [black, JJ], [leather, NN], [couch, ..."
4,1,473003,100031,grex,77949,a brown couch with no pillows on it,"[[a, DT], [brown, JJ], [couch, NN], [with, IN]..."

-------------------- gw_df --------------------

n rows: 821,889

,corpus_id,image_id,dial_id,turn_id,q,a,target,all_objs,success,split
0,1,175527,0,5200,is it in the sky?,No,179938,"[1424479, 622400, 179938, 180748]",True,test
1,1,175527,0,5208,is it the umbrella?,No,179938,"[1424479, 622400, 179938, 180748]",True,test
2,1,175527,0,5219,is it the ocean?,No,179938,"[1424479, 622400, 179938, 180748]",True,test
3,1,175527,0,5223,is it the lifeboat?,Yes,179938,"[1424479, 622400, 179938, 180748]",True,test
4,1,547168,1,5247,is it a skier?,No,1451774,"[1450014, 1451774, 470158, 540439, 511050, 546...",True,test

-------------------- mscoco_bbdf --------------------

n rows: 604,907

   i_corpus  image_id  region_id                               bb  cat
0         1    480023         86  [116.95, 305.86, 285.3, 266.03]   58
1         1     50518         89    [245.54, 208.17, 40.14, 19.1]   58
2         1    142589         93    [288.4, 18.07, 211.6, 331.33]   58
3         1    209263        113    [126.5, 475.24, 77.68, 76.73]   58
4         1     15307        116   [185.57, 93.4, 219.97, 420.29]   58

-------------------- mscoco_catsdf --------------------

n rows: 80

          cat supercat
1      person   person
2     bicycle  vehicle
3         car  vehicle
4  motorcycle  vehicle
5    airplane  vehicle

-------------------- refcoco_refdf --------------------

n rows: 142,210

,i_corpus,image_id,region_id,r_corpus,rex_id,refexp,tagged
0,1,581857,1719310,refcoco,0,the lady with the blue shirt,"[[the, DT], [lady, NN], [with, IN], [the, DT],..."
1,1,581857,1719310,refcoco,1,lady with back to us,"[[lady, NN], [with, IN], [back, NN], [to, TO],..."
2,1,581857,1719310,refcoco,2,blue shirt,"[[blue, JJ], [shirt, NN]]"
3,1,581857,463958,refcoco,3,woman in gray shirt facing camera on right,"[[woman, NN], [in, IN], [gray, JJ], [shirt, NN..."
4,1,581857,463958,refcoco,4,woman gray right,"[[woman, NN], [gray, NN], [right, NN]]"

-------------------- refcocoplus_refdf --------------------

n rows: 141,564

,i_corpus,image_id,region_id,r_corpus,rex_id,refexp,tagged
0,1,581857,1719310,refcoco,0,navy blue shirt,"[[navy, JJ], [blue, NN], [shirt, NN]]"
1,1,581857,1719310,refcoco,1,woman back in blue,"[[woman, NN], [back, RB], [in, IN], [blue, NN]]"
2,1,581857,1719310,refcoco,2,blue shirt,"[[blue, JJ], [shirt, NN]]"
3,1,581857,463958,refcoco,3,gray shirt wearing glasses,"[[gray, JJ], [shirt, NN], [wearing, NN], [glas..."
4,1,581857,463958,refcoco,4,lady with glasses,"[[lady, NN], [with, IN], [glasses, NNS]]"

-------------------- saiapr_bbdf --------------------

n rows: 99,534

   i_corpus  image_id  region_id                   bb  cat
0         0       112          1   [76, 50, 371, 308]  120
1         0       112          2     [0, 260, 89, 96]  204
2         0       112          3  [390, 206, 89, 151]  204
3         0       112          4     [0, 0, 156, 191]   29
4         0       112          5   [374, 0, 104, 165]   29

-------------------- saiapr_refdf --------------------

n rows: 120,081

,i_corpus,image_id,region_id,r_corpus,rex_id,refexp,tagged
0,0,8756,2,referit,0,sunray at very top,"[[sunray, NN], [at, IN], [very, RB], [top, JJ]]"
1,0,21905,1,referit,1,sky,"[[sky, NN]]"
2,0,14576,1,referit,2,seal,"[[seal, NN]]"
3,0,15169,5,referit,3,the sand in the bottom right corner,"[[the, DT], [sand, NN], [in, IN], [the, DT], [..."
4,0,6263,1,referit,4,dirt path,"[[dirt, NN], [path, NN]]"

-------------------- vd_df --------------------

n rows: 1,253,510

,corpus_id,image_id,dial_id,turn_id,question,answer,trigger_caption,split
0,1,378466,0,0,is this a child or adult,adult,a person that is laying next to a dog,train
1,1,378466,0,1,male or female,male,a person that is laying next to a dog,train
2,1,378466,0,2,are they inside or outside,inside,a person that is laying next to a dog,train
3,1,378466,0,3,are they laying on the floor,"yes, but there is a blanket in between them an...",a person that is laying next to a dog,train
4,1,378466,0,4,is the floor carpeted or wooden,it is tile,a person that is laying next to a dog,train

-------------------- vgattdf --------------------

n rows: 1,674,166

   i_corpus  image_id   obj_id          attributes
0         5         1  1058498       [green, tall]
1         5         1     5046          [sidewalk]
2         5         1     5048              [grey]
3         5         1     5050               [off]
4         5         1     5051  [parked, far away]

-------------------- vgimgdf --------------------

n rows: 108,077

   i_corpus  image_id  coco_id  flickr_id  width  height
0         5         1      NaN        NaN    800     600
1         5         2      NaN        NaN    800     600
2         5         3      NaN        NaN    640     480
3         5         4      NaN        NaN    640     480
4         5         5      NaN        NaN    800     600

-------------------- vgobjdf --------------------

n rows: 3,895,567

   i_corpus  image_id   obj_id            syn      name                    bb
0         5         1  1058498     clock.n.01     clock    [421, 91, 79, 339]
1         5         1     5046    street.n.01    street   [77, 328, 714, 262]
2         5         1     5045     shade.n.01     shade  [119, 338, 274, 192]
3         5         1  1058529       man.n.01       man   [238, 249, 60, 262]
4         5         1     5048  gym_shoe.n.01  sneakers    [243, 489, 52, 26]

-------------------- vgpardf --------------------

n rows: 19,561

   image_id                                          paragraph  i_corpus
0   2356347  A large building with bars on the windows in f...         5
1   2317429  A white round plate is on a table with a plast...         5
2   2414610  A woman in a blue tennis outfit stands on a gr...         5
3   2365091  A large red and white train is traveling on tr...         5
4   2383120  A very clean and tidy a bathroom. Everything i...         5

-------------------- vgregdf --------------------

n rows: 5,406,592

,i_corpus,image_id,coco_id,flickr_id,region_id,phrase,bb,rel_ids,rels,pphrase
0,5,1,NaN,NaN,1382,the clock is green in colour,"[421, 57, 82, 139]",None,None,None
1,5,1,NaN,NaN,1383,shade is along the street,"[194, 372, 182, 109]",[15927],"[[5045, ON, along.r.01, 5046]]",shade|5045|shade.n.01 is along the street|5046...
2,5,1,NaN,NaN,1384,man is wearing sneakers,"[241, 491, 61, 30]",[15928],"[[1058529, wears, wear.v.01, 5048]]",man|1058529|man.n.01 is wearing sneakers|5048|...
3,5,1,NaN,NaN,1385,cars headlights are off,"[617, 377, 36, 36]",[15929],"[[5049, has, have.v.01, 5050]]",
4,5,1,NaN,NaN,1386,bikes are parked at the far edge,"[322, 298, 41, 49]",None,None,None

-------------------- vgreldf --------------------

n rows: 2,324,859

,i_corpus,image_id,rel_syn,predicate,rel_id,sub_syn,sub_id,obj_syn,obj_id
0,5,1,along.r.01,ON,15927,shade.n.01,5045,street.n.01,5046
1,5,1,wear.v.01,wears,15928,man.n.01,1058529,gym_shoe.n.01,5048
2,5,1,have.v.01,has,15929,car.n.01,5049,headlight.n.01,5050
3,5,1,along.r.01,ON,15930,sign.n.02,1058507,building.n.01,1058508
4,5,1,along.r.01,ON,15931,trunk.n.01,5055,sidewalk.n.01,1058534

-------------------- vgvqadf --------------------

n rows: 1,445,322

,i_corpus,image_id,qa_id,q,a,q_objs,a_objs,region_id
0,5,1,986768,What color is the clock?,Green.,[],[],1382.0
1,5,1,986769,How many people are there?,Two.,[],[],1383.0
2,5,1,986772,What color is the man's shirt?,Red.,[],[],1434.0
3,5,1,986777,What are the men doing?,Interacting.,[],[],1486.0
4,5,1,986780,Where is the white work truck?,Parked on the street.,[],[],1535.0

-------------------- vqa --------------------

n rows: 658,111

,i_corpus,image_id,q_id,q,a,q_type,split
0,1,458752,458752000,What is this photo taken looking through?,net,what is this,train
1,1,458752,458752001,What position is this man playing?,pitcher,what,train
2,1,458752,458752002,What color is the players shirt?,orange,what color is the,train
3,1,458752,458752003,Is this man a professional baseball player?,yes,is this,train
4,1,262146,262146000,What color is the snow?,white,what color is the,train

==================== Summary ====================

                 name     rows
0           ade_imgdf    19733
1           ade_objdf   550545
2           ade_reldf   146392
3           cococapdf   414113
4       cocoent_capdf   592881
5       cocoent_objdf  1182608
6    cocogrprops_bbdf    17184
7          cub_attrdf   371011
8            cub_bbdf    11787
9           cub_capdf   117870
10         cub_partdf   141395
11        flickr_bbdf   275775
12       flickr_capdf   158915
13       flickr_objdf   559767
14         grex_refdf    95010
15              gw_df   821889
16        mscoco_bbdf   604907
17      mscoco_catsdf       80
18      refcoco_refdf   142210
19  refcocoplus_refdf   141564
20        saiapr_bbdf    99534
21       saiapr_refdf   120081
22              vd_df  1253510
23            vgattdf  1674166
24            vgimgdf   108077
25            vgobjdf  3895567
26            vgpardf    19561
27            vgregdf  5406592
28            vgreldf  2324859
29            vgvqadf  1445322
30                vqa   658111